<template>
  <div class="guide">
    <el-tree :data="data" :props="defaultProps" @node-click="handleNodeClick"></el-tree>
    <div class="description">
      <el-card class="box-card">
        <div slot="header" class="clearfix">
          <span>{{cardTitle}}</span>
        </div>
        <div v-for="o in 1" :key="o">
          {{cardContent}}
        </div>
      </el-card>
    </div>
  </div>
</template>

<script>
  export default {
    data() {
      return {
        data: [{
          label: '1.总体介绍',
        }, {
          label: '2.用户注册',
          children: [{
            label: '注册用户综述'
          }, {
            label: '个人用户窗口注册'
          }, {
            label: '个人用户网上注册'
          }, {
            label: '单位用户窗口注册'
          }]
        }, {
          label: '3.常见问题',
          children: [{
            label: '驾驶证申请'
          }, {
            label: '驾驶人考试'
          }, {
            label: '驾驶证使用'
          }, {
            label: '校车标牌及驾驶人'
          }, {
            label: '交通违法记分'
          }, {
            label: '服务群众措施'
          }, {
            label: '高速公路驾驶机动车'
          }, {
            label: '法律责任'
          }]
        }, {
          label: '4.政策法规'
        }],
        cardTitle:'总体介绍',
        cardContent:'互联网交通安全综合服务管理平台（以下简称互联网服务平台）采用网页、语音、短信、移动终端APP四种方式，为广大交通参与者提供交管动态、安全宣传、警示教育，以及交通管理信息查询、告知、业务预约/受理/办理、道路通行等便民利民服务。目前，已完成网页方式交管动态、安全宣传、警示教育，交通管理信息查询、告知、通报、抄告，交通管理业务预约/受理/办理服务，以及短信方式交通管理信息告知功能。其中，交通管理业务包括补换领机动车号牌、补换领机动车行驶证、补领机动车检验合格标志、预选机动车号牌、机动车安全技术检验预约、申领机动车临时行驶车号牌，补换领机动车驾驶证、考试预约、驾驶人身体条件证明提交、驾驶人延期换证/延期审验/延期提交身体条件证明，以及违法处理和违法罚款缴纳等。网上交通管理业务将随着公安机关交通管理部门业务保障机制建设进展，逐步向广大交通参与者提供。请广大交通参与者访问互联网服务平台获取最新服务信息。\\n" +\n' +
          '            "\\n" +\n' +
          '            "为提高服务水平和服务质量，公安部申请了“12123”政府公益类服务短号码，用于在全国范围内向广大交通参与者提供短信方式交通管理信息告知和语音方式交通管理信息咨询、业务办理等服务。下步，公安部将抓紧开展语音服务中心、移动终端APP，以及道路通行服务等建设应用工作。今后，将陆续向广大交通参与者提供相应服务。敬请期待！',
        defaultProps: {
          children: 'children',
          label: 'label'
        }
      };
    },
    methods: {
      handleNodeClick(data) {
        let cardName = data.label;
        console.log(cardName[0]);
        if(cardName[0]==='1'||cardName[0]==='4'){
          cardName = cardName.substring(2);
        }
        if(cardName[0]==='2'||cardName[0]==='3'){
          return;
        }
        this.cardTitle = cardName;
        if(cardName==="总体介绍"){
          this.cardContent = "互联网交通安全综合服务管理平台（以下简称互联网服务平台）采用网页、语音、短信、移动终端APP四种方式，为广大交通参与者提供交管动态、安全宣传、警示教育，以及交通管理信息查询、告知、业务预约/受理/办理、道路通行等便民利民服务。目前，已完成网页方式交管动态、安全宣传、警示教育，交通管理信息查询、告知、通报、抄告，交通管理业务预约/受理/办理服务，以及短信方式交通管理信息告知功能。其中，交通管理业务包括补换领机动车号牌、补换领机动车行驶证、补领机动车检验合格标志、预选机动车号牌、机动车安全技术检验预约、申领机动车临时行驶车号牌，补换领机动车驾驶证、考试预约、驾驶人身体条件证明提交、驾驶人延期换证/延期审验/延期提交身体条件证明，以及违法处理和违法罚款缴纳等。网上交通管理业务将随着公安机关交通管理部门业务保障机制建设进展，逐步向广大交通参与者提供。请广大交通参与者访问互联网服务平台获取最新服务信息。\n" +
            "\n" +
            "为提高服务水平和服务质量，公安部申请了“12123”政府公益类服务短号码，用于在全国范围内向广大交通参与者提供短信方式交通管理信息告知和语音方式交通管理信息咨询、业务办理等服务。下步，公安部将抓紧开展语音服务中心、移动终端APP，以及道路通行服务等建设应用工作。今后，将陆续向广大交通参与者提供相应服务。敬请期待！"
        }
        if(cardName==="注册用户综述"){
          this.cardContent = "1、注册用户包括个人用户和单位用户。个人用户包括“车主或驾驶人”、“初次申领机动车驾驶证的学员”、“新车车主”3类。单位用户包括道路运输企业、驾驶培训机构、汽车销售商、医院、学校等企事业单位，以及道路运输管理部门、教育行政部门、安监部门等政府机关。\n" +
            "\n" +
            "2、个人用户账号全国唯一，可以实现“本地注册→本地登录→部级登录→全国漫游”。单位用户账号本地唯一，只能“本地注册→本地登录”。\n" +
            "\n" +
            "3、注册方式包括窗口注册和网上注册两种。个人用户可以选择到公安机关交通管理部门进行窗口注册或访问互联网服务平台进行网上注册。单位用户只能选择窗口注册。\n" +
            "\n" +
            "4、个人用户登录本地互联网服务平台后，权限允许情况下，可以网上获取本人本地机动车和驾驶证的状态和交通管理安全告知信息查询、机动车登记、驾驶证管理、违法处理，异地机动车和驾驶证的状态查询服务。个人用户需要网上获取本人异地机动车和驾驶证的交通安全告知信息查询、机动车登记、驾驶证管理、违法处理服务的，需要登录本地互联网服务平台后，漫游至机动车登记地和驾驶证核发地互联网服务平台。其中，网上获取违法处理服务时，对于非机动车登记地发生的电子监控记录违法行为，需要漫游至违法发生地互联网服务平台。\n" +
            "\n" +
            "5、单位用户登录本地互联网服务平台后，可以网上获取《互联网单位用户注册/变更申请表》中选择的服务类型。"
        }else if(cardName==="个人用户窗口注册"){
          this.cardContent = "个人用户窗口注册时，携带本人身份证明,填写《互联网个人用户注册/变更申请表》，并提交《互联网个人用户注册/变更申请表》填写说明中要求的身份证明材料。个人用户提交注册申请后，公安机关交通管理部门将在1个工作日内完成审核并通过短信方式将用户账号和密码发至个人用户注册时填写的手机号码。\n" +
            "\n" +
            "1、车主或驾驶人\n" +
            "在本地拥有机动车或驾驶证的本地居民或在本地长期居住的非本地人，可以进行窗口注册。注册成功后，可以网上获取互联网服务平台所有本人本地机动车和驾驶证的状态和交通安全告知信息查询、机动车登记业务、驾驶证管理，本人、非本人的机动车违法处理等服务。\n" +
            "\n" +
            "2、初次申领机动车驾驶证的学员\n" +
            "对于在本地没有机动车和驾驶证、已经在本地办理初次申领机动车驾驶证业务的学员，可以进行窗口注册。注册成功后，可以网上获取考试预约和预选机动车号牌服务。用户获取驾驶证后，将自动转为窗口注册驾驶人用户。\n" +
            "\n" +
            "3、新车车主\n" +
            "对于在本地没有机动车和驾驶证、需要在本地办理新车注册登记业务的本地居民或在本地长期居住的非本地人，可以进行窗口注册。注册成功后，可以网上获取预选机动车号牌服务。用户完成新车注册登记业务后，将自动转为窗口注册车主用户。"
        }else if(cardName==="个人用户网上注册"){
          this.cardContent = "网上注册个人用户需要办理其他互联网业务、且符合前述窗口注册条件的，可以到窗口办理网上注册用户转窗口注册用户变更业务。\n" +
            "\n" +
            "1、车主或驾驶人\n" +
            "拥有本地机动车或驾驶证、且在办理机动车登记业务或驾驶证申领业务时填写的手机号码与现有手机号码相同的个人用户，可以进行网上注册。网上注册成功后，可以网上获取本人机动车和驾驶证信息查询、违法处理和罚款缴纳、预选机动车号牌、考试预约及变更联系方式服务。\n" +
            "\n" +
            "2、初次申领机动车驾驶证的学员\n" +
            "学员在本地办理初次申领驾驶证业务后，可以进行网上注册。网上注册成功后，可以网上获取考试预约和预选机动车号牌服务。用户获取驾驶证后，将自动转为网上注册驾驶人用户，或用户绑定本人机动车后，将自动转为网上注册机动车用户。在准考证明有效期内没有完成考试获取驾驶证，同时没有绑定本人机动车的个人用户，其用户账号将被自动取消。\n" +
            "\n" +
            "3、新车车主\n" +
            "对于在全国范围内没有机动车和驾驶证、需要在本地办理新车注册登记业务的个人用户，可以进行网上注册。网上注册成功后，可以网上获取预选机动车号牌服务。注册成功后24小时内未预选机动车号牌或已预选机动车号牌但未在预选号牌有效期内到公安机关交通管理部门办理新车注册登记业务的，其用户账号将被自动取消，且不允许该身份证明号码在网上采用相同的手机号码注册新车车主用户。预选机动车号牌成功、到公安机关交通管理部门办理新车注册登记业务时，如果填写的身份证明号码、姓名和手机号码与网上注册时填写的身份证明号码、姓名和手机号码不一致，将不允许办理新车注册登记业务。用户完成新车注册登记业务后，用户将自动转为网上注册车主用户。"
        }else if(cardName==="单位用户窗口注册"){
          this.cardContent = "1、单位用户窗口注册时，需填写《互联网单位用户注册/变更申请表》，并提交《互联网单位用户注册/变更申请表》填写说明中要求的身份证明材料。单位用户提交注册申请后，公安机关交通管理部门将当场完成审核、核发用户数字证书（注册时单位类型选择”其他“时，不核发数字证书），并在1个工作日内通过短信方式将用户账号和密码发至注册时填写的申请人手机号码。\n" +
            "\n" +
            "2、单位用户网上业务包括：“1、本单位本地营运机动车和驾驶人信息查询和通报”、“2、本单位本地校车和校车驾驶人信息查询和通报”、“3、本单位本地非营运机动车信息查询”、“4、本辖区营运机动车和驾驶人信息通报”、“5、本辖区校车和校车驾驶人信息通报”、“6、业务办理等其他服务”。\n" +
            "\n" +
            "3、道路运输企业可申请1、2、3业务；驾驶培训机构、汽车销售商、医院可申请3、6业务；学校可申请2、3业务；道路运输管理部门、安监部门可申请3、4业务；教育行政部门可申请3、5业务；其他单位可申请3业务。\n" +
            "\n" +
            "4、所有单位用户账号均可以网上获取预选机动车号牌服务；对于申请了6的汽车销售商单位用户，可以网上获取机动车临时号牌核发服务；对于申请了6的医院单位用户，可以网上获取医院体检、提交身体条件证明服务；对于申请了6的驾校单位用户，可以网上获取本单位学员预约信息查询、学员预录入、学员用户窗口注册等服务。"
        }else if(cardName==="驾驶证申请"){
          this.cardContent = "1. 申请驾驶证对申请人年龄有什么具体要求？\n" +
            "\n" +
            " 答： 申请驾驶证最低年龄要求： 小型汽车、小型自动挡汽车、残疾人专用小型自动挡载客汽车、轮式自行机械车、低速载货汽车、三轮汽车、摩托车为18周岁，城市公交车、大型货车、电车为20周岁，中型客车为21周岁，牵引车为24周岁，大型客车为26岁。 最高年龄限制要求 ：小型汽车、小型自动挡汽车、残疾人专用小型自动挡载客汽车、轻便摩托车为70周岁，低速载货汽车、普通摩托车、三轮汽车、轮式自行机械车为60周岁，城市公交车及其他大中型客货车、电车为50周岁。 \n" +
            "\n" +
            "2. 申请人有吸食或注射毒品行为的能否申请驾驶证？\n" +
            "\n" +
            " 答：三年内有吸毒行为记录的，解除强制隔离戒毒措施不满三年的，或者长期服用依赖性精神药品成瘾尚未戒除的，不得申请驾驶证。公安交管部门在受理驾驶证申请时，会核查申请人是否有吸毒行为记录，审查医疗机构出具的身体条件证明。对三年内有吸毒行为记录以及解除强制隔离戒毒措施不满三年等情形的，将不予受理。同时，申请人在申请驾驶证时，应当如实申告是否具有以上不准申请的情形，并对申告内容的真实性负责。 \n" +
            "\n" +
            "3. 哪种违法犯罪行为将被终身禁驾？\n" +
            "\n" +
            " 答：一是造成交通事故后逃逸构成犯罪的，二是饮酒后或者醉酒驾驶机动车发生重大交通事故构成犯罪的。上述两种情形都是严重、恶性的违法行为，对公共安全危害大，导致人员伤亡或财产损失后果严重，需要追究刑事责任，因此规定终身不得再申请驾驶证。 \n" +
            "\n" +
            "4. 因饮酒后或醉酒驾驶被吊销驾驶证能否重新申请？\n" +
            "\n" +
            " 答：因饮酒后驾驶营运机动车或者醉酒驾驶机动车依法被吊销驾驶证的，5年内不得重新申领；因醉酒驾驶营运机动车依法被吊销驾驶证的，10年内不得重新申领。需要提醒的是，饮酒后或者醉酒驾驶机动车发生重大交通事故构成犯罪的，终身不得申请驾驶证。 \n" +
            "\n" +
            "5. 申请大中型客货车驾驶证有什么限制条件？\n" +
            "\n" +
            " 答：取得大型客货车、牵引车、中型客车和大型货车驾驶证的驾驶人大部分驾驶营运车辆，交通安全责任重大，因此规定了更为严格的限制条件。一是对发生死亡交通事故负同等以上责任的或者有醉酒驾驶记录的，终身不得申请大中型客货车驾驶证。二是对被处以吊销或者撤销驾驶证记录的，10年内不得申请大中型客货车驾驶证。三是对有记满12分记录的，5年内不得申请大型客车驾驶证，3年内不得申请牵引车、中型客车驾驶证。 被吊销、撤销驾驶证的情形包括醉酒驾车、超速50%以上、驾驶拼装车或者报废车上路行驶、以欺骗、贿赂等不正当手段取得驾驶证的严重违法行为，均属主观故意行为，有必要对当事人再次申请驾驶证特别是大中型客货车驾驶证时采取更加严格的限制措施。 \n"
        }else if(cardName==="驾驶人考试"){
          this.cardContent = "1. 机动车驾驶人考试有什么主要变化？\n" +
            "\n" +
            " 答：为增强考试的针对性和实用性，确保更多小汽车驾驶人考试合格后能够独立驾车上路，提高大中型客货车驾驶人应对复杂条件的能力，139号令对小型汽车、大中型客货车的考试项目主要做了以下调整： 科目一考试， 将原来的考试内容拆分为两部分，第一部分主要考核道路交通安全法律法规、交通信号、通行规则等知识，仍作为科目一；第二部分作为安全文明驾驶考试项目，在实际道路考试后进行，考核安全文明驾驶要求、复杂条件下的安全驾驶知识等。 科目二考试， 大中型客货车增加模拟高速公路、雨雾天、湿滑路、紧急情况处置等考试项目，调整后由原来的“训练10项、考试6项”修改为“训练、考试均为16项”；小型汽车取消桩考移库要求以及通过连续障碍、单边桥等现实生活中应用性不强的考试项目，调整后由原来的“训练10项、考试4项”改为“训练和考试均为5项”，即倒车入库、坡道定点停车与起步、侧方停车、曲线行驶、直角转弯。 科目三考试， 增加了加减挡位操作、路口左转弯、路口右转弯3个考试项目和安全文明驾驶常识考试。同时，对于小型汽车抽取不少于20%进行夜间考试，不进行夜间考试的进行模拟夜间灯光使用考试。对大中型客货车增加山区、隧道、陡坡等复杂道路考试。另外，还明确了各种车型的考试里程。 \n" +
            "\n" +
            "2. 科目一考试具体有什么变化？\n" +
            "\n" +
            " 答：考虑到学员考试科目一时基本没有实际驾驶操作经验，安全文明驾驶等知识只能靠死记硬背，难以深入理解、掌握并应用。139号令实施后，科目一考试主要考核道路交通安全法律法规、交通信号、通行规则等最基本的知识，将原科目一中有关安全文明驾驶要求、复杂条件下的安全驾驶技能、紧急情况下的临危处置等知识单列出来，作为科目三中的安全文明驾驶常识考试项目，放在实际道路驾驶考试后进行。科目一考试试卷由100道题目组成，题型为判断题和单项选择题，满分100分，90分合格。公安部已经对现有的考试题库进行了修订，并会同交通运输部制定发布了培训教学和考试大纲，列出培训和考核目标、要点，供培训机构培训教学时使用。 \n" +
            "\n"
        }else if(cardName==="驾驶证使用"){
          this.cardContent = "1. 对大中型客货车驾驶人审验有哪些规定？\n" +
            "\n" +
            " 答：大型客车、牵引车、城市公交车、中型客车、大型货车驾驶人审验的情形包括两种：\n" +
            "一是 每个记分周期结束后三十日内，应当到公安交管部门接受审验。但在一个记分周期内没有记分记录的，免予本记分周期的审验。审验时，驾驶人应当填表如实申报身体条件，不需要提交医疗机构出具的身体条件证明。\n" +
            "二是 驾驶证转到异地或者有效期满换证时，应当到公安交管部门接受审验。审验时，驾驶人应当提交医疗机构出具的身体条件证明。\n" +
            "需要提醒的是， 驾驶人没有按照规定参加审验仍驾驶机动车的，公安交管部门将处200元以上500元以下罚款。部分大型客车、牵引车、城市公交车、中型客车、大型货车驾驶人，如果没有驾驶大中型客货车需求的，可以主动申请降为小型汽车驾驶证，避免因逾期未审验受到相关的处罚。 \n" +
            "\n" +
            "2. 对小型汽车、摩托车等驾驶人审验有哪些规定？\n" +
            "\n" +
            " 答：小型汽车、摩托车等车型驾驶人审验的情形有两种：\n" +
            "一是 发生交通事故造成人员死亡承担同等以上责任未被吊销驾驶证的，应当在记分周期结束后三十日内到公安交管部门接受审验；\n" +
            "二是 驾驶证转到异地或者有效期满换证时，应当到公安交管部门接受审验。 需要提醒的是 ，驾驶人没有按照规定参加审验仍驾驶机动车的，公安交管部门将处200元以上500元以下罚款。 \n" +
            "\n" +
            "3. 对驾驶人审验有哪些内容？\n" +
            "\n" +
            " 答：公安交管部门将审验驾驶人的交通违法和事故处理、身体条件、违法记分和记满12分后参加学习教育等情况。大型客车、牵引车、城市公交车、中型客车、大型货车驾驶人有违法记分，以及小型汽车、摩托车等车型驾驶人发生交通死亡事故承担同等以上责任未被吊销驾驶证的，在接受审验时应当参加不少于三小时的道路交通安全法律法规、交通安全文明驾驶、应急处置等知识学习，并接受交通事故案例警示教育。 \n" +
            "\n" +
            "4. 驾驶证转入换证时已审验的，记分周期结束后是否还需要再审验？\n" +
            "\n" +
            " 答：驾驶人办理转入换证时应当按照规定参加审验。转入后在本记分周期结束前，大中型客货车驾驶人产生新记分的，以及其他车型驾驶人发生死亡事故负同等以上责任的，应当在记分周期结束后三十日内再次参加审验。在办理转入换证审验时已经参加学习教育的，再次审验时不需要参加学习教育。 \n" +
            "\n" +
            "5. 大中型客货车驾驶人在139号令实施前的记分是否作为参加审验的依据？\n" +
            "\n" +
            " 答：按照法律不溯及既往的原则，2013年1月1日之前发生违法行为及记分，不作为是否参加审验的依据。2013年1月1日之后发生的违法行为及记分，作为是否参加审验的依据。 \n"
        }else if(cardName==="校车标牌及驾驶人"){
          this.cardContent = "1. 申请校车驾驶许可需要满足那些条件？\n" +
            "\n" +
            " 答：校车安全运行关系学生上下学安全，社会影响大，校车驾驶人需要具备更高的安全驾驶意识、技能。根据《校车安全管理条例》和139号令规定，申请校车驾驶资格应具备6项条件：\n" +
            "一是 取得相应准驾车型驾驶证并具有三年以上驾驶经历，年龄在25周岁以上、不超过60周岁；\n" +
            "二是 最近连续三个记分周期内没有被记满分记录；\n" +
            "三是 无致人死亡或者重伤的交通事故责任记录； 四是 无酒后驾驶或者醉酒驾驶机动车记录，最近一年内无驾驶客运车辆超员、超速等严重交通违法行为记录； 五是 无犯罪记录； 六是 身心健康，无传染性疾病，无癫痫病、精神病等可能危及行车安全的疾病病史，无酗酒、吸毒行为记录。\n" +
            "需要提醒的是， 凡是年龄条件不符合要求、有记满12分记录以及其他不符合校车驾驶资格申请条件的，将取消驾驶人的校车驾驶资格。 \n" +
            "\n" +
            "2. 如何申请校车驾驶资格？\n" +
            "\n" +
            " 答：符合规定条件的驾驶人可以向所在县级或者设区的市级公安交管部门提出申请，填写申请表，并提交4项申请材料：填写申请表，并提交以下证明：\n" +
            "（一）申请人的身份证明；\n" +
            "（二）机动车驾驶证；\n" +
            "（三）户籍所在地县级公安机关出具的无犯罪、吸毒行为记录证明；\n" +
            "（四）县级或者部队团级以上医疗机构出具的有关身体条件的证明。"
        }else if(cardName==="交通违法记分"){
          this.cardContent = "1. 在高速公路上驾车哪些违法行为一次记12分？\n" +
            "\n" +
            " 答：与在普通公路上驾车相比，高速公路车速快、路况更加复杂，一旦发生事故导致的后果严重。因此，公安部123令针对高速公路特殊性，制定更加严格的记分规定，记12分的情形有：\n" +
            "一是 在高速公路上倒车、逆行、穿越中央分隔带掉头的。\n" +
            "二是 驾驶营运客车在高速公路车道内停车的。\n" +
            "三是 驾驶中型以上载客载货汽车、校车、危险物品运输车辆超过规定时速20%以上的。 \n" +
            "\n" +
            "2. 驾驶营运车辆有交通违法行为如何记分？\n" +
            "\n" +
            " 答：营运车辆一般是长时间、高频率地在道路上行驶，而且载客载货数量多，一旦发生事故，往往造成重大人员财产损失，驾驶人需要承担的社会责任重大。因此，公安部139号令针对驾驶营运车辆违法规定了更加严格的记分规定，\n" +
            "一是 一次记12分的情形有：驾驶营运客车（不包括公共汽车）超过核定人数20％以上的，驾驶营运客车在高速公路车道内停车的。\n" +
            "二是 一次记6分的情形有：驾驶营运客车（不包括公共汽车）超过核定人数未达20％的，驾驶货车载物超过核定载质量30%以上或者违反规定载客的。对营运车辆驾驶人其他交通违法行为的记分，依照《道路交通安全违法行为记分分值》的有关规定执行。 \n" +
            "\n" +
            "3. 对超速行驶违法行为如何记分？\n" +
            "\n" +
            " 答：超速行驶是严重的交通违法行为之一，危险系数高，一旦发生事故造成的后果极其严重，是近年来全国公安交管部门重点整治的严重交通违法行为。公安部139号令对超速驾驶制定了严格的记分规定。\n" +
            "一是 超速驾驶一次记12分的情形有：驾驶中型以上载客载货汽车、校车、危险物品运输车辆在高速公路、城市快速路上行驶超过规定时速20％以上或者在高速公路、城市快速路以外的道路上行驶超过规定时速50％以上；驾驶其他机动车行驶超过规定时速50%以上的。\n" +
            "二是 一次记6分的情形有：驾驶中型以上载客载货汽车、校车、危险物品运输车辆在高速公路、城市快速路上行驶超过规定时速未达20％的；驾驶中型以上载客载货汽车、校车、危险物品运输车辆在高速公路、城市快速路以外的道路上行驶或者驾驶其他机动车行驶超过规定时速20%以上未达到50%的。\n" +
            "三是 一次记3分的情形有：驾驶中型以上载客载货汽车、危险物品运输车辆在高速公路、城市快速路以外的道路上行驶或者驾驶其他机动车行驶超过规定时速未达20%的。 \n" +
            "\n"
        }else if(cardName==="服务群众措施"){
          this.cardContent = "1. 在异地申请办理驾驶证审验和机动车检验有什么要求？\n" +
            "\n" +
            " 答：目前，随着物流业的迅速发展，很多营运驾驶人和货运车辆长期不在登记地从事道路运输活动，在驾驶证或者车辆临近检验期限时，需要从营运地返回登记地办理审验业务。为方便群众就近办理业务，139号令规定将在异地从事营运的驾驶人和货运车辆纳入营运地管辖，营运驾驶人和货运车辆所有人首先要向营运地公安交管部门申请备案登记，并填报包括营运企业、手机号码等基本信息，公安交管部门将根据这些基本信息开展提示服务和日常教育。在办理备案登记满一年后，可以在营运地直接办理驾驶证审验和机动车检验。\n" +
            "需要提醒的是， 备案登记制度只适用于营运驾驶人和货运车辆。对于非营运的小型车辆，机动车所有人可以向登记地车辆管理所申请在异地进行检验。 \n" +
            "\n" +
            "2. 驾驶证丢失后补领需要多长时间？\n" +
            "\n" +
            " 答：139号令实施后，对驾驶证遗失或损坏的，驾驶人在申请办理补换证的1日内即可领取到新的驾驶证。此前，车辆管理所办理核发和补换领驾驶证业务的时限均为3日。近年来，随着车辆管理所内部管理更加规范，机动车登记和驾驶证管理系统等网络和技术手段的不断完善，以及车辆管理所工作岗位的优化调整，在更短时限内办理这些业务的条件已经具备。将核发和补换领驾驶证的时限缩短为1日，方便丢失驾驶证的申请人能够及时补领到驾驶证。 \n" +
            "\n" +
            "3. 在县级车管所能否参加驾驶证考试和审验？\n" +
            "\n" +
            " 答：县级车管所可以办理低速载货汽车、三轮汽车、摩托车驾驶证考试，以及全部类型驾驶证的补证、换证、审验等业务。对于具备了相应考试场地、设备、路线和考试员等条件的，也可以直接受理小型汽车、小型自动挡汽车、残疾人自动挡载客汽车驾驶证全部科目的考试，以及其他类型驾驶证的道路交通安全法律、法规和相关知识考试。由于受经济发展条件影响，各地县级车管所基础条件、警力配置等差异较大，具体的业务范围和办理条件由省级公安交管部门根据当地实际情况确定。 \n" +
            "\n" +
            "4. 如何查询办理驾驶证业务需要提交的材料和要求？\n" +
            "\n" +
            " 答：目前，公安交管部门主要通过三种途径公示业务办理需要提交的材料、表格、条件、依据、程序以及收费标准等事项。\n" +
            "一是 在车管所、交通服务站等办公场所公示业务办理事项，设立业务导办台，方便申请人咨询；\n" +
            "二是 省级、市级公安交管部门通过互联网主页发布信息，便于申请人在网上查阅有关规定、驾驶证记分等信息，下载有关表格；\n" +
            "三是 一些公安交管部门还开通了车管电话服务热线，供群众咨询，并受理部分业务。 "
        }else if(cardName==="高速公路驾驶机动车"){
          this.cardContent = "1. 驾驶人实习期内驾驶机动车上高速公路有什么规定？\n" +
            "\n" +
            " 答：2004年5月1日《道路交通安全法》实施以前，禁止驾驶人实习期内驾驶机动车上高速公路行驶。考虑到进入新世纪我国高速公路路网建设速度加快，以及个人拥有的机动车保有量不断增多，群众自驾出行越来越多，很多驾驶人在实习期内都要出行，特别是自驾游等中长途出行，需要在高速公路上驾车行驶，《道路交通安全法》实施以后，不再限制驾驶人实习期上高速公路行驶。但从驾驶人实习期在高速公路驾车发生的事故看，很大一部分是由于驾驶技能不高、经验不足引发的，139号令借鉴了国外的做法，规定驾驶人在实习期内驾驶机动车上高速公路行驶，应当由持相应或者更高准驾车型驾驶证三年以上的驾驶人陪同。其中，驾驶残疾人专用小型自动挡载客汽车的，可以由持有小型自动挡载客汽车以上准驾车型驾驶证的驾驶人陪同。不过，在增加准驾车型后的实习期内，驾驶原准驾车型的机动车时不受上述限制。 \n" +
            "\n" +
            "2. 公安交管部门将如何检查驾驶人实习期内驾驶机动车上高速公路是否有陪驾？\n" +
            "\n" +
            " 答：法律的实施需要国家强制力保障，但更多需要公民自觉守法。落实驾驶人在实习期内驾驶机动车上高速公路行驶应当由持相应或者更高准驾车型驾驶证三年以上驾驶人陪同的规定，同样靠驾驶人的自觉遵守。公安交管部门主要依托高速公路收费站、出入口、服务区等进行抽查，发现处于实习期且无相应或者更高准驾车型驾驶证三年以上驾驶人陪同的，已经或正在高速公路上行驶的，公安交管部门将按照139号令规定，对驾驶人处20元以上200元以下罚款，并责令就近驶离高速公路；正准备进入高速公路的，教育后劝返。 \n" +
            "\n" +
            "3. 实习期驾驶人在高速公路发生事故后，陪同驾驶人员是否需要承担责任？\n" +
            "\n" +
            " 答：实习期驾驶人驾驶机动车在高速公路上发生道路交通事故的，公安交管部门将根据调查证实的实习期驾驶人的交通违法及过错，认定事故责任。如果有证据证明陪同的驾驶人强迫实习期驾驶人违反道路交通安全法律、法规和机动车安全驾驶要求驾驶机动车，造成交通事故，陪同驾驶人应承担事故相应责任。对于尚不构成犯罪的，按照《道路交通安全法》第九十九条规定，对陪同人员处以200元以上2000元以下罚款；构成犯罪的，依法追究刑事责任。 \n" +
            "\n"
        }else if(cardName==="法律责任"){
          this.cardContent = "1. 申请人在申领驾驶证中有隐瞒、欺骗等行为的，有什么法律后果？\n" +
            "\n" +
            " 答：根据《行政许可法》，行政许可申请人有如实申告有关事项的法律义务。驾驶机动车事关广大交通参与者的出行安全，驾驶证申请人要如实申告自己的年龄条件、身体条件，参加规定的考试通过后方可取得驾驶证。139号令规定，申请人申领驾驶证时如果有隐瞒、欺骗、贿赂等行为的，公安交管部门要立即终止办理该申请人的业务，在计算机系统中记录，该申请人在一年内不得再次申领驾驶证。隐瞒、欺骗、贿赂等行为包括：提供伪造身份证、体检证明等虚假材料，隐瞒自己有器质性心脏病、癫痫病、美尼尔症等妨碍安全驾驶的疾病，隐瞒自己有三年内有吸毒行为或者解除强制隔离戒毒措施未满三年等不允许申请驾驶证的情形，考试中有贿赂、舞弊等行为。如果申请人已经取得了驾驶证，公安交管部门将撤销驾驶许可，收缴驾驶证，申请人在三年内不得再次申领驾驶证。\n" +
            "需要提醒的是， 《机动车驾驶证申请表》和《驾驶人身体条件证明》上均有相关的提示信息，请驾驶证申请人如实填写申请表格，如实提供申请材料，严格参加相关考试。 \n" +
            "\n" +
            "2. 驾驶人违反实习期管理规定，有哪些处罚？\n" +
            "\n" +
            " 答：实习期驾驶人违反实习期管理规定的情形主要有三种：\n" +
            "一是 在实习期内驾驶公共汽车、营运客车或者执行任务的警车、消防车、救护车、工程救险车以及载有爆炸物品、易燃易爆化学物品、剧毒或者放射性等危险物品的机动车，或者驾驶机动车牵引挂车。这些车辆有的属于公共交通工具，有的属于特种车辆、危险品运输车辆，公共安全责任重大，《道路交通安全法实施条例》规定实习期驾驶人不得驾驶。\n" +
            "二是 在实习期内驾驶机动车上高速公路行驶时，没有持相应或更高以上车型驾驶证三年以上的驾驶人陪同指导。\n" +
            "三是 未按规定粘贴、悬挂实习标志。如果实习期驾驶人有上述情形之一的，公安交管部门将处以20元以上200元以下罚款。 \n" +
            "\n" +
            "3. 对伪造、变造驾驶证的有哪些处罚？\n" +
            "\n" +
            " 答：伪造、变造驾驶证是一种严重的交通违法行为。2011年4月22日全国人大常委会关于修改《道路交通安全法》的决定，对伪造、变造驾驶证的违法行为加重了处罚力度。139号令根据法律规定，明确：伪造、变造或者使用伪造、变造的驾驶证的，由公安交管部门予以收缴，处十五日以下拘留，并处2000元以上5000元以下罚款；构成犯罪的，依法追究刑事责任。无论是自己伪造、变造驾驶证，还是使用伪造、变造的驾驶证，都要按照上述规定予以处罚。其中，伪造、变造驾驶证构成犯罪的，将按照伪造、变造国家机关公文、证件、印章罪追究刑事责任。 \n" +
            "\n"
        }else if(cardName==="政策法规"){
          this.cardContent = "《中华人民共和国道路交通安全法》"
        }












      }
    }
  };
</script>

<style>
  .guide{
    margin-top: 1.5rem;
  }
  .el-tree {
    width: 18rem;
    float:left;
    height: 26rem
  }
  .box-card{
    width:71rem;
    margin-left:20rem;
    height: 26rem
  }
</style>
